In [4]:
import pandas as pd
customer_details = pd.read_excel("grocery_database.xlsx", sheet_name = "customer_details")
product_areas = pd.read_excel("grocery_database.xlsx", sheet_name = "product_areas")

In [5]:
#We need to convert gender M=0 and F=1
#MAP
#See males and females in two different columns
customer_details["gender_numeric"] = customer_details["gender"].map({"M":0,
                                                                    "F" : 1})

In [6]:
customer_details
#As we can see, male and female are now coded well here.

     customer_id  distance_from_store gender  credit_score  gender_numeric
0             74                 3.38      F          0.59             1.0
1            524                 4.76      F          0.52             1.0
2            607                 4.45      F          0.49             1.0
3            343                 0.91      M          0.54             0.0
4            322                 3.02      F          0.63             1.0
..           ...                  ...    ...           ...             ...
865          372                 4.38      F          0.50             1.0
866          104                 2.36      F          0.63             1.0
867          393                 1.87      M          0.59             0.0
868          373                 0.21      M          0.47             0.0
869          712                 0.07      M          0.70             0.0

[870 rows x 5 columns]

In [8]:
#If you didn't code M and just coded F, you'd get null/Nan values for M
#Make sure that you specify all values in the mapping dictionary

#Replace
customer_details["gender_numeric"] = customer_details["gender"].replace({"M":0,
                                                                    "F" : 1})
customer_details["gender_numeric"] = customer_details["gender"].replace({"F" : 1})

In [9]:
customer_details
#Here, we get original values rather than nulls.
#Replace -  I will keep value the same unless you tell me to specifically replace it.
#Mapping requires you to bring over certain values rather than have them carried across.

     customer_id  distance_from_store gender  credit_score gender_numeric
0             74                 3.38      F          0.59              1
1            524                 4.76      F          0.52              1
2            607                 4.45      F          0.49              1
3            343                 0.91      M          0.54              M
4            322                 3.02      F          0.63              1
..           ...                  ...    ...           ...            ...
865          372                 4.38      F          0.50              1
866          104                 2.36      F          0.63              1
867          393                 1.87      M          0.59              M
868          373                 0.21      M          0.47              M
869          712                 0.07      M          0.70              M

[870 rows x 5 columns]

In [10]:
#Apply
#Call a function and apply it
product_areas["product_area_name"].apply(len)
#Applying length function to product_area_name
#length of strings in each row

0     8
1    10
2     5
3     5
4     4
Name: product_area_name, dtype: int64

In [12]:
#Create function to update profit margin
#If profit margin > 20%, then it needs to increase by a small amount, otherwise it needs to go down
#This is just an example for apply function - logic is off
def update_profit_margin(profit_margin):
    if profit_margin > 0.2:
        return profit_margin*1.2
    else:
        return profit_margin*0.8

In [13]:
product_areas["profit_margin_updated"] = product_areas["profit_margin"].apply(update_profit_margin)

In [14]:
product_areas

   product_area_id product_area_name  profit_margin  profit_margin_updated
0                1          Non-Food           0.25                  0.300
1                2        Vegetables           0.18                  0.144
2                3             Fruit           0.14                  0.112
3                4             Dairy           0.19                  0.152
4                5              Meat           0.11                  0.088

In [18]:
#Apply method can be used on a whole data frame

x = pd.DataFrame({"A" :[1,2], "B": [3,4], "C":[5,6]})

x.apply(max)
#We can maximum value that exists in each column
#Apply works on axis = 0

A    2
B    4
C    6
dtype: int64

In [17]:
#We can do this for rows
x.apply(max,axis=1)

0    5
1    6
dtype: int64

In [19]:
#ApplyMap
def square(n):
    return n ** 2

In [20]:
x.applymap(square)
#Applied square function to all entire data frame

   A   B   C
0  1   9  25
1  4  16  36

In [ ]:
#This is useful for all text, all number data...though most data sets are mixed in nature